[
  {
    "type": "free_weight",
    "id": "chest_1",
    "name": "Barbell Bench Press",
    "description": "Lie flat on a bench with feet planted firmly on the ground. Grip the barbell slightly wider than shoulder-width and unrack it, positioning it directly over your chest. Lower the bar in a controlled manner to your mid-chest, keeping your elbows at about a 45-degree angle. Press the bar back up explosively while maintaining a slight arch in your lower back and keeping your shoulder blades retracted throughout the movement. This is the fundamental compound movement for building overall chest mass and strength.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_2",
    "name": "Incline Barbell Press",
    "description": "Set an adjustable bench to a 30-45 degree incline and position yourself under a barbell in a rack with feet planted firmly. Grip the bar slightly wider than shoulder-width and unrack it, holding it above your upper chest. Lower the bar in a controlled manner to your upper chest, keeping your elbows at about a 45-degree angle. Press the bar back up explosively, focusing on contracting your upper pectorals while maintaining shoulder blade retraction throughout the movement. This targets the often-underdeveloped upper chest region.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_3",
    "name": "Decline Barbell Press",
    "description": "Secure your legs at the top of a decline bench set to 15-30 degrees and carefully lie back with the barbell positioned at arm's length above your lower chest. Lower the bar to your lower sternum with elbows tucked at 45 degrees, maintaining control throughout the descent. Press the bar back up in a slight arc toward your upper chest, keeping your shoulder blades retracted. Focus on engaging your lower pectorals while maintaining a stable base with your legs secured. This emphasizes the lower chest region.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_4",
    "name": "Dumbbell Bench Press",
    "description": "Sit on a flat bench with dumbbells resting on your thighs, then kick them up as you lie back, positioning them at chest level with palms facing forward. Press the dumbbells up until your arms are fully extended, bringing them slightly together at the top. Lower with control until your elbows are slightly below shoulder level, feeling a stretch in your chest. The dumbbell variation allows for greater range of motion and more natural movement patterns compared to barbell, helping address strength imbalances between sides.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_5",
    "name": "Incline Dumbbell Press",
    "description": "Set an adjustable bench to a 30-45 degree incline and sit with dumbbells resting on your thighs. Kick the weights up as you lie back, positioning them at shoulder level with palms facing forward. Press the dumbbells up and slightly together at the top, following a natural arc. Lower with control until your elbows are slightly below shoulder level, feeling a stretch in your upper chest. This movement provides excellent upper chest activation with the added benefit of unilateral work to fix muscle imbalances.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_6",
    "name": "Decline Dumbbell Press",
    "description": "Secure yourself on a decline bench set to 15-30 degrees with dumbbells in hand. Position the dumbbells at your lower chest with palms facing forward. Press the weights up until arms are extended, bringing them slightly together at the top. Lower with control, allowing elbows to go slightly below torso level for a deep stretch in your lower chest. This variation targets the lower pectorals while the decline angle reduces shoulder involvement, making it easier on the shoulder joints.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_7",
    "name": "Dumbbell Chest Fly",
    "description": "Lie on a flat bench with a dumbbell in each hand, arms extended above your chest with a slight bend in your elbows and palms facing each other. Lower the weights out to your sides in a wide arc, keeping the bend in your elbows constant throughout. Descend until you feel a deep stretch across your chest, but don't let your elbows drop below shoulder level. Squeeze your pecs to bring the dumbbells back together above your chest, maintaining the arc motion. This isolation movement emphasizes the stretch and contraction of the chest muscles.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_8",
    "name": "Incline Dumbbell Fly",
    "description": "Set a bench to 30-45 degrees and lie back with dumbbells held above your upper chest, palms facing each other with a slight elbow bend. Lower the weights out and down in a wide arc, maintaining the fixed elbow angle throughout the movement. Feel a deep stretch across your upper chest at the bottom position. Bring the dumbbells back together using your chest muscles, following the same arc path. The incline angle specifically targets the upper pectorals and front deltoids.",
    "isCustom": false,
    "targetMuscles": ["chest", "shoulders"]
  },
  {
    "type": "free_weight",
    "id": "chest_9",
    "name": "Decline Dumbbell Fly",
    "description": "Secure yourself on a decline bench with dumbbells held at arm's length above your lower chest, palms facing each other with slightly bent elbows. Lower the weights out to the sides in an arc motion, keeping elbows at a fixed angle. Descend until you feel a stretch in your lower chest without letting elbows drop too low. Squeeze your lower pecs to bring the dumbbells back to starting position. The decline angle shifts tension to the lower chest fibers and reduces shoulder strain.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "bodyweight",
    "id": "chest_10",
    "name": "Push-Ups",
    "description": "Start in a high plank position with hands slightly wider than shoulder-width apart and body forming a straight line from head to heels. Lower your chest toward the ground by bending your elbows, keeping them at a 45-degree angle to your torso. Descend until your chest is just above the floor or touches it, maintaining core tension throughout. Push back up to the starting position, fully extending your arms while keeping your body rigid. This classic bodyweight movement builds functional pressing strength and core stability.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_11",
    "name": "Incline Push-Ups",
    "description": "Place your hands on an elevated surface like a bench, box, or bar set at waist to chest height, slightly wider than shoulder-width. Step your feet back to create a straight body line at an incline angle. Lower your chest toward the elevated surface by bending your elbows to 45 degrees. Push back up to full arm extension while maintaining core engagement. The elevated hand position makes this easier than regular push-ups, perfect for beginners or high-rep finishing sets while still effectively working the chest.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_12",
    "name": "Decline Push-Ups",
    "description": "Place your feet on an elevated surface like a bench or box while your hands are on the ground slightly wider than shoulder-width. Maintain a straight body line from elevated feet to head. Lower your chest toward the floor with elbows at 45 degrees, descending until chest nearly touches ground. Push back up powerfully to full extension. The feet-elevated position increases difficulty and shifts more emphasis to the upper chest and shoulders, making it ideal for advanced trainees.",
    "isCustom": false,
    "targetMuscles": ["chest", "shoulders"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_13",
    "name": "Diamond Push-Ups",
    "description": "Assume a push-up position with hands close together under your chest, forming a diamond or triangle shape with your index fingers and thumbs touching. Keep your body in a straight line from head to heels with core engaged and elbows tucked very close to your sides. Lower yourself until your chest nearly touches your hands, maintaining the tight elbow position. Press back up to full arm extension. While this heavily emphasizes triceps, it also provides excellent inner chest stimulation due to the narrow hand placement.",
    "isCustom": false,
    "targetMuscles": ["chest", "arms"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_14",
    "name": "Wide-Grip Push-Ups",
    "description": "Set up in a push-up position with hands placed significantly wider than shoulder-width, roughly 1.5 to 2 times your shoulder width. Keep your body straight and core tight. Lower your chest toward the ground, allowing your elbows to flare out more than standard push-ups. Descend until chest is just above floor, feeling a stretch across your chest. Push back up to starting position. The wide grip reduces tricep involvement and places greater stretch and tension on the chest muscles, particularly the outer pecs.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_15",
    "name": "Chest Dips",
    "description": "Grasp parallel bars or dip handles and jump or step up to support yourself with straight arms. Lean your torso forward about 30 degrees and allow your feet to drift slightly behind you. Lower yourself by bending your elbows and allowing them to flare slightly outward, descending until you feel a deep stretch in your chest or your upper arms are parallel to the ground. Keep the forward lean throughout. Push back up to the starting position, focusing on contracting your chest muscles. This advanced bodyweight movement heavily loads the chest and is excellent for building mass.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": true
  },
  {
    "type": "machine",
    "id": "chest_16",
    "name": "Machine Chest Press",
    "description": "Adjust the seat height so the handles align with your mid-chest and sit with your back flat against the pad. Grip the handles with a neutral or pronated grip and plant your feet firmly. Push the handles forward in a smooth, controlled motion, extending your arms fully without locking out your elbows. Squeeze your chest at the peak contraction. Return the weight to the starting position with control, maintaining tension in your chest throughout the negative portion. Machines provide stable, consistent resistance ideal for safely pushing to failure.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_17",
    "name": "Cable Chest Fly",
    "description": "Stand in the center of a cable machine with handles set at shoulder height, grasping one in each hand with arms extended out to your sides. Step forward into a staggered stance and lean slightly forward, maintaining a soft bend in your elbows. Bring the handles together in front of your chest in a wide arc motion, focusing on squeezing your pecs at the point where your hands meet. Control the weight back to the starting position, feeling a stretch across your chest. Cables provide constant tension throughout the entire range of motion.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_18",
    "name": "Cable Crossover Low to High",
    "description": "Set cable pulleys to the lowest position and grasp a handle in each hand, standing in the center with arms extended down and out to the sides. Step forward into a split stance and maintain a slight forward lean with chest up. Pull the handles upward and together in front of your upper chest, crossing them slightly at the top in an arc motion. Focus on squeezing your upper pecs while controlling the weight back to the starting position with arms fully extended. This angle specifically targets the upper chest fibers.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_19",
    "name": "Cable Crossover High to Low",
    "description": "Set cable pulleys to the highest position and stand in the center, grasping a handle in each hand with arms extended up and out. Step forward into a staggered stance with a slight forward lean. Pull the handles downward and together in front of your lower abdomen in an arc motion, crossing them at the bottom. Focus on contracting your lower chest as you bring the cables together. Control the weight back up, feeling a stretch in your lower pecs. This downward angle emphasizes the lower chest region.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_20",
    "name": "Pec Deck Machine",
    "description": "Sit in a pec deck machine with your back flat against the pad and feet planted firmly on the ground. Position your forearms against the vertical pads with elbows bent at 90 degrees and at shoulder height. Adjust the seat so your upper arms are parallel to the floor. Squeeze your chest to bring the pads together in front of you, focusing on the contraction at the peak. Slowly control the pads back out to the starting position, feeling a deep stretch across your chest. This machine provides excellent isolation for the chest with minimal shoulder involvement.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_21",
    "name": "Smith Machine Bench Press",
    "description": "Position a flat bench centered under the Smith machine bar. Lie back with the bar aligned over your mid-chest and grip it slightly wider than shoulder-width. Unrack the bar by rotating it and lower it to your chest in a controlled manner, keeping elbows at 45 degrees. Press the bar back up along the fixed vertical path until arms are extended. The Smith machine provides a stable, guided bar path making it ideal for training without a spotter, pushing to failure safely, or focusing purely on chest contraction without worrying about balance.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_22",
    "name": "Smith Machine Incline Press",
    "description": "Set an incline bench at 30-45 degrees under a Smith machine bar. Lie back and position the bar over your upper chest. Unrack and lower the bar to your upper chest with control. Press back up along the fixed path. The Smith machine's stability allows you to focus on upper chest contraction and safely train to failure without a spotter.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_23",
    "name": "Smith Machine Decline Press",
    "description": "Set a decline bench under a Smith machine bar and secure your legs. Position the bar over your lower chest, unrack, and lower with control to your lower sternum. Press back up. The fixed path and decline angle target the lower pecs while the machine's stability allows for safe heavy loading.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_24",
    "name": "Incline Machine Press",
    "description": "Sit in an incline chest press machine with the seat adjusted so handles are at upper chest height. Press the handles forward until arms are extended, focusing on upper chest contraction. Return with control. The machine's fixed path isolates the upper chest effectively and allows for training to failure safely.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_25",
    "name": "Decline Machine Press",
    "description": "Sit in a decline chest press machine with handles positioned at lower chest level. Press forward until arms extend, focusing on lower pec engagement. The decline angle and machine stability make this excellent for targeting the lower chest with heavy weight safely.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_26",
    "name": "Plate-Loaded Chest Press",
    "description": "Sit in a plate-loaded chest press machine with your back against the pad. Grip the handles and press forward until arms are extended. The plate-loaded design provides a natural pressing movement with heavy loading capability, excellent for building raw pressing strength.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_27",
    "name": "Hammer Strength Chest Press",
    "description": "Sit in a Hammer Strength chest press with handles at chest level. Press the handles forward independently or simultaneously. The independent handles allow for unilateral training and natural movement paths, making this one of the most effective chest machines for muscle development.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_28",
    "name": "Single-Arm Cable Chest Press",
    "description": "Stand in a cable station with one handle set at chest height. Position yourself perpendicular to the machine and press the handle forward across your body. This unilateral variation challenges core stability while building single-arm pressing strength and addressing imbalances.",
    "isCustom": false,
    "targetMuscles": ["chest", "core"]
  },
  {
    "type": "bodyweight",
    "id": "chest_29",
    "name": "Plyometric Push-Ups",
    "description": "Perform a push-up but push explosively enough that your hands leave the ground. Land softly and immediately descend into the next rep. This explosive variation builds power and fast-twitch muscle fiber recruitment in the chest, shoulders, and triceps.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_30",
    "name": "Clapping Push-Ups",
    "description": "Perform an explosive push-up, pushing hard enough to lift your hands off the ground and clap before landing. This advanced plyometric exercise builds explosive power and fast-twitch fiber development in the chest and triceps.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_31",
    "name": "Archer Push-Ups",
    "description": "Start in a wide push-up position. As you lower, shift your body weight to one side while straightening the opposite arm out to the side. Push back up and alternate sides. This advanced variation increases unilateral strength and challenges stability.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_32",
    "name": "Pseudo Planche Push-Ups",
    "description": "Start in a push-up position but place your hands further back near your hips with fingers pointing backward or outward. Lean forward and perform push-ups with your shoulders well in front of your hands. This advanced variation requires tremendous shoulder and chest strength and is a progression toward planche training.",
    "isCustom": false,
    "targetMuscles": ["chest", "shoulders"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_33",
    "name": "Typewriter Push-Ups",
    "description": "In a wide push-up position, lower down and shift your body horizontally to one side, then shift across to the other side before pushing back up. This side-to-side movement pattern challenges the chest from multiple angles while building stability.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "chest_34",
    "name": "Pike Push-Ups",
    "description": "Start in a downward dog position with hips high and body forming an inverted V. Lower your head toward the ground by bending your elbows. Push back up to starting position. While primarily targeting shoulders, this also works the upper chest and is a great bodyweight progression.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "chest"],
    "canAddWeight": false
  },
  {
    "type": "free_weight",
    "id": "chest_35",
    "name": "Floor Press",
    "description": "Lie on the floor with a barbell or dumbbells. Lower the weight until your elbows touch the floor, then press back up. The floor limits range of motion, making this excellent for building lockout strength and is easier on the shoulders than full range presses.",
    "isCustom": false,
    "targetMuscles": ["chest", "arms"]
  },
  {
    "type": "free_weight",
    "id": "chest_36",
    "name": "Dumbbell Floor Press",
    "description": "Lie on the floor holding dumbbells. Press them up until arms are extended, then lower until triceps touch the floor. The limited range of motion makes this shoulder-friendly while still effectively building chest and tricep strength.",
    "isCustom": false,
    "targetMuscles": ["chest", "arms"]
  },
  {
    "type": "free_weight",
    "id": "chest_37",
    "name": "Single-Arm Dumbbell Press",
    "description": "Lie on a flat bench holding one dumbbell. Press it up with one arm while keeping your torso stable and avoiding rotation. This unilateral variation challenges core stability and addresses strength imbalances between sides.",
    "isCustom": false,
    "targetMuscles": ["chest", "core"]
  },
  {
    "type": "free_weight",
    "id": "chest_38",
    "name": "Close-Grip Barbell Bench Press",
    "description": "Lie on a bench and grip the barbell with hands about shoulder-width apart or slightly closer. Lower the bar to your lower chest keeping elbows tucked close to your body. Press back up. While emphasizing triceps, this also works the inner chest effectively.",
    "isCustom": false,
    "targetMuscles": ["chest", "arms"]
  },
  {
    "type": "free_weight",
    "id": "chest_39",
    "name": "Guillotine Press",
    "description": "Lie on a bench and grip a barbell slightly wider than normal. Lower the bar to your neck/upper chest area rather than mid-chest, keeping elbows flared. This variation places extreme stretch on the pecs but requires caution and lighter weight due to shoulder stress.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_40",
    "name": "Svend Press",
    "description": "Stand holding two weight plates together at chest level. Press them straight out in front of you while squeezing them together, keeping constant tension. Bring back to chest. This unique movement emphasizes the inner chest and teaches constant tension technique.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_41",
    "name": "Landmine Press",
    "description": "Place one end of a barbell in a landmine attachment. Hold the other end at shoulder level and press it upward at an angle. This angled pressing path is easier on the shoulders while still effectively targeting the chest and front delts.",
    "isCustom": false,
    "targetMuscles": ["chest", "shoulders"]
  },
  {
    "type": "free_weight",
    "id": "chest_42",
    "name": "Single-Arm Landmine Press",
    "description": "Hold one end of a landmine barbell at shoulder level with one arm. Press it upward and slightly across your body. This unilateral variation challenges stability and allows for a natural pressing path that's shoulder-friendly.",
    "isCustom": false,
    "targetMuscles": ["chest", "shoulders"]
  },
  {
    "type": "free_weight",
    "id": "chest_43",
    "name": "Neutral Grip Dumbbell Press",
    "description": "Lie on a bench holding dumbbells with palms facing each other (neutral grip). Press up and lower with control. This grip is often more shoulder-friendly than pronated grips and can feel more natural for many lifters.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "free_weight",
    "id": "chest_44",
    "name": "Alternating Dumbbell Press",
    "description": "Lie on a bench with both dumbbells held at chest level. Press one dumbbell up while keeping the other at chest level, then alternate. This variation increases time under tension and challenges core stability as you resist rotation.",
    "isCustom": false,
    "targetMuscles": ["chest", "core"]
  },
  {
    "type": "machine",
    "id": "chest_45",
    "name": "Cable Chest Press",
    "description": "Stand between cable towers with handles set at chest height. Hold both handles at chest level and press forward until arms extend. Step forward for stability. Cables provide constant tension throughout the movement, differing from free weight pressing.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_46",
    "name": "Low Cable Fly",
    "description": "Set cables at the lowest position and grab both handles. Bring them together and upward in front of your upper chest. This upward angle specifically targets the upper chest fibers from a unique angle.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_47",
    "name": "Mid Cable Fly",
    "description": "Set cables at chest height and perform flys straight across your chest. This horizontal angle provides balanced tension across the entire chest without emphasizing upper or lower regions.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_48",
    "name": "High Cable Fly",
    "description": "Set cables at the highest position and bring handles together and downward in front of your lower abdomen. This downward angle emphasizes the lower chest fibers.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "machine",
    "id": "chest_49",
    "name": "Single-Arm Cable Fly",
    "description": "Use one cable handle set at chest height. Stand perpendicular and bring the handle across your body in a fly motion. This unilateral variation allows for greater range of motion and helps address imbalances.",
    "isCustom": false,
    "targetMuscles": ["chest"]
  },
  {
    "type": "bodyweight",
    "id": "chest_50",
    "name": "Ring Dips",
    "description": "Support yourself on gymnastic rings with arms extended. Lean forward slightly and lower yourself by bending elbows, allowing them to flare outward. The unstable rings require tremendous stabilization, making this significantly harder than parallel bar dips while building exceptional chest, shoulder, and core strength.",
    "isCustom": false,
    "targetMuscles": ["chest"],
    "canAddWeight": true
  },
  {
    "type": "assisted_machine",
    "id": "chest_51",
    "name": "Assisted Chest Dip Machine",
    "description": "Set the desired assistance weight on the machine and kneel or stand on the platform, grasping the parallel dip handles with arms extended. The platform will support some of your bodyweight, making the movement easier. Lean your torso forward about 30 degrees to emphasize chest activation. Lower yourself by bending your elbows and allowing them to flare slightly outward, descending until you feel a deep stretch in your chest or your upper arms are parallel to the ground. Maintain the forward lean throughout. Push back up to the starting position, focusing on contracting your chest muscles. Perfect for building strength toward unassisted chest dips while heavily loading the pectorals.",
    "isCustom": false,
    "targetMuscles": ["chest", "arms", "shoulders"]
  }
]
