[
  {
    "type": "free_weight",
    "id": "shoulders_1",
    "name": "Barbell Overhead Press",
    "description": "Stand with feet shoulder-width apart and hold a barbell at shoulder height with hands slightly wider than shoulder-width, elbows pointed slightly forward. Brace your core and press the bar straight up overhead until your arms are fully extended, moving your head back slightly to allow the bar to pass. Lock out at the top with biceps by your ears, then lower the bar back to the starting position with control. This compound movement is the king of shoulder builders, primarily targeting the anterior and medial deltoids while also engaging the triceps and upper chest.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_2",
    "name": "Seated Barbell Overhead Press",
    "description": "Sit on a bench with back support and hold a barbell at shoulder height with hands slightly wider than shoulder-width. Press the bar straight up overhead until your arms are fully extended, then lower back to shoulder height with control. The seated position removes leg drive and stabilization demands, allowing you to focus purely on shoulder strength. This variation is excellent for isolating the deltoids and building pressing strength with slightly more stability than the standing version.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_3",
    "name": "Dumbbell Overhead Press",
    "description": "Stand or sit with feet shoulder-width apart holding dumbbells at shoulder height with palms facing forward and elbows at about 90 degrees. Press both dumbbells up and slightly inward until your arms are fully extended overhead, then lower back to the starting position with control. The independent movement of each arm requires more stabilization than a barbell and helps identify and correct strength imbalances. This exercise builds overall shoulder mass and strength while improving shoulder stability.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_4",
    "name": "Seated Dumbbell Overhead Press",
    "description": "Sit on a bench with back support holding dumbbells at shoulder height with palms facing forward. Press both dumbbells straight up until your arms are fully extended, then lower back to shoulder height with control. The seated position eliminates leg drive and lower body compensation, forcing your shoulders to do all the work. This variation allows you to lift heavier weights with better form than standing, making it excellent for building shoulder mass and strength.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_5",
    "name": "Arnold Press",
    "description": "Sit on a bench holding dumbbells at shoulder height with palms facing you and elbows in front of your body. As you press the dumbbells up, rotate your palms outward so they face forward at the top of the movement. Lower back down while rotating your palms back to face you. This rotational pressing variation, made famous by Arnold Schwarzenegger, provides a unique stimulus by working the shoulders through a greater range of motion and hitting all three deltoid heads more completely than standard presses.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_6",
    "name": "Single-Arm Dumbbell Press",
    "description": "Stand or sit holding a dumbbell at shoulder height in one hand, your other hand on your hip or extended for balance. Press the dumbbell straight up until your arm is fully extended, then lower back to shoulder height with control. The unilateral nature creates an anti-lateral flexion challenge for your core while building single-arm pressing strength. This variation helps identify and correct imbalances while improving shoulder stability and core engagement.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "core"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_7",
    "name": "Push Press",
    "description": "Stand with feet shoulder-width apart holding a barbell at shoulder height. Dip slightly by bending your knees, then explosively drive through your legs while pressing the bar overhead. Use leg drive to generate momentum to help you press heavier weights overhead than you could with strict pressing alone. Lower back to shoulders with control. This explosive variation allows you to overload the shoulders with heavier weight while building power and developing the stretch-shortening cycle.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "legs"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_8",
    "name": "Dumbbell Lateral Raise",
    "description": "Stand with feet shoulder-width apart holding dumbbells at your sides with palms facing in. Keeping a slight bend in your elbows, raise the dumbbells out to the sides until your arms are parallel to the ground, leading with your elbows. Pause briefly at the top, then lower back down with control. Avoid using momentum or excessive body English. This isolation exercise specifically targets the medial (side) deltoids, crucial for building shoulder width and creating the coveted V-taper.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_9",
    "name": "Cable Lateral Raise",
    "description": "Stand beside a cable machine with the cable set at the lowest position. Grab the handle with your far hand (crossing in front of your body) and step away slightly to create tension. With a slight bend in your elbow, raise the cable out to the side until your arm is parallel to the ground. Lower with control, maintaining tension throughout. The constant tension from the cable provides a different stimulus than dumbbells, keeping the medial delts under load throughout the entire range of motion.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_10",
    "name": "Seated Lateral Raise",
    "description": "Sit on the edge of a bench holding dumbbells at your sides with palms facing in. Raise the dumbbells out to the sides until your arms are parallel to the ground, leading with your elbows. Lower back down with control. The seated position removes the ability to use momentum or body English, forcing strict form and making the exercise more challenging. This variation ensures maximum isolation of the medial deltoids.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_11",
    "name": "Dumbbell Front Raise",
    "description": "Stand with feet shoulder-width apart holding dumbbells in front of your thighs with palms facing down or toward each other. Keeping your arms straight with a slight bend in the elbows, raise one or both dumbbells directly in front of you until they reach shoulder height. Lower back down with control without swinging. This isolation movement specifically targets the anterior (front) deltoids, which are also heavily involved in pressing movements.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_12",
    "name": "Barbell Front Raise",
    "description": "Stand holding a barbell in front of your thighs with an overhand grip, hands about shoulder-width apart. Keeping your arms straight with a slight elbow bend, raise the barbell directly in front of you until it reaches shoulder height or slightly above. Lower back down with control. Using a barbell allows you to lift heavier weight than dumbbells while working both front delts simultaneously, building strength and mass in the anterior deltoids.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_13",
    "name": "Cable Front Raise",
    "description": "Stand facing away from a cable machine with the cable set at the lowest position. Hold the handle or rope behind your back with both hands or one hand. Raise your arm(s) forward and up until shoulder height or slightly above. Lower with control, maintaining tension throughout. The cable provides constant tension on the front delts throughout the entire movement, offering a unique stimulus compared to free weight variations.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_14",
    "name": "Bent-Over Dumbbell Reverse Fly",
    "description": "Stand with feet shoulder-width apart, hinge forward at the hips until your torso is nearly parallel to the ground, holding dumbbells hanging straight down with palms facing each other. Keeping a slight bend in your elbows, raise the dumbbells out to the sides until your arms are parallel to the ground, squeezing your rear delts and upper back. Lower with control. This isolation exercise targets the often-neglected posterior (rear) deltoids, essential for shoulder health and balanced development.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_15",
    "name": "Seated Bent-Over Dumbbell Reverse Fly",
    "description": "Sit on the edge of a bench with your torso bent forward over your thighs, holding dumbbells behind your calves with palms facing each other. Raise the dumbbells out to the sides by squeezing your rear delts, lifting until your arms are parallel to the ground. Lower back down with control. The seated position provides stability and ensures strict form, maximizing rear deltoid isolation while minimizing lower back strain.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "machine",
    "id": "shoulders_16",
    "name": "Cable Reverse Fly",
    "description": "Stand in the middle of a cable crossover station with cables set at shoulder height. Cross your arms and grab the opposite handles (left hand grabs right cable, right hand grabs left). Pull the cables back and outward in a reverse fly motion, squeezing your rear delts and bringing your arms out to the sides. Return with control. The constant cable tension effectively targets the posterior deltoids throughout the entire range of motion.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "machine",
    "id": "shoulders_17",
    "name": "Face Pull",
    "description": "Attach a rope to a cable machine at upper chest or face height. Grab both ends of the rope with an overhand grip and step back to create tension. Pull the rope toward your face, separating the ends and bringing them beside your ears, with your elbows high and back. Squeeze your rear delts and upper back, then return to the starting position with control. This exercise targets the rear deltoids, rhomboids, and rotator cuff, crucial for shoulder health and posture.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "machine",
    "id": "shoulders_18",
    "name": "Pec Deck Reverse Fly",
    "description": "Sit facing a pec deck machine with your chest against the pad. Grab the handles with arms extended in front of you at shoulder height. Pull the handles back and outward in a reverse fly motion, squeezing your rear delts and bringing your arms out to the sides. Return with control. The fixed path and constant tension of the machine make this an excellent rear delt builder, especially useful for beginners learning the movement pattern.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_19",
    "name": "Barbell Upright Row",
    "description": "Stand holding a barbell in front of your thighs with an overhand grip, hands about shoulder-width apart or slightly closer. Pull the bar straight up along your body by leading with your elbows, bringing the bar to upper chest or chin height. Keep the bar close to your body throughout. Lower with control. This compound movement targets all three deltoid heads with particular emphasis on the medial delts, while also working the upper traps.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_20",
    "name": "Dumbbell Upright Row",
    "description": "Stand holding dumbbells in front of your thighs with palms facing your body. Pull the dumbbells straight up by leading with your elbows, bringing them to upper chest height while keeping them close to your body. Lower back down with control. The dumbbells allow for a more natural movement path than a barbell, reducing potential shoulder discomfort while still effectively targeting the deltoids and upper traps.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "machine",
    "id": "shoulders_21",
    "name": "Cable Upright Row",
    "description": "Stand facing a cable machine with a straight bar or rope attachment set at the lowest position. Pull the attachment up along your body to upper chest height. The cable provides constant tension throughout the movement, making it an effective variation for deltoid and trap development.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "machine",
    "id": "shoulders_22",
    "name": "Shoulder Press Machine",
    "description": "Sit in a shoulder press machine with the handles at shoulder height. Press the handles up until your arms are extended, then lower back with control. Machines provide a stable, guided path that's excellent for safely training to failure and building strength.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_23",
    "name": "Plate-Loaded Shoulder Press",
    "description": "Sit in a plate-loaded shoulder press machine. Grip the handles and press upward until arms are extended. The plate-loaded design provides a natural pressing movement and allows for heavy loading.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_24",
    "name": "Lateral Raise Machine",
    "description": "Sit in a lateral raise machine with your arms against the pads. Raise your arms out to the sides by contracting your medial delts. The machine provides consistent resistance throughout the movement and is excellent for isolation work.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_25",
    "name": "Smith Machine Overhead Press",
    "description": "Sit or stand in a Smith machine with the bar at shoulder height. Press the bar overhead along the fixed vertical path. The guided bar path allows for heavy loading with reduced stabilization demands.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_26",
    "name": "Bradford Press",
    "description": "Hold a barbell at shoulder height. Press it up but stop just before full lockout. Lower the bar behind your head to neck level, then press back up and lower to the front. This continuous tension variation hits all three deltoid heads while maintaining constant muscle engagement.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_27",
    "name": "Behind-the-Neck Press",
    "description": "Sit or stand with a barbell positioned at the base of your neck. Press the bar straight up overhead. This variation requires good shoulder mobility and emphasizes the medial and posterior deltoids. Use caution and lighter weight due to increased shoulder stress.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_28",
    "name": "Landmine Press",
    "description": "Hold one end of a landmine barbell at shoulder height. Press it upward at an angle. The angled pressing path is easier on the shoulders while effectively targeting the front and medial deltoids.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_29",
    "name": "Single-Arm Landmine Press",
    "description": "Hold one end of a landmine barbell at shoulder level with one arm. Press upward and slightly across your body. This unilateral variation challenges stability and allows for a natural, shoulder-friendly pressing path.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "core"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_30",
    "name": "Kettlebell Press",
    "description": "Hold a kettlebell at shoulder height with the bell resting on the back of your forearm. Press it overhead while rotating your palm forward. The unique kettlebell shape provides a different challenge for shoulder stability.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_31",
    "name": "Z-Press",
    "description": "Sit on the floor with legs extended in front of you. Hold a barbell or dumbbells at shoulder height and press overhead. This seated floor variation removes leg drive and lower back arch, forcing strict shoulder strength.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "core"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_32",
    "name": "Viking Press",
    "description": "Stand between the handles of a Viking press or landmine attachment. Grip both handles and press straight up. This neutral grip pressing variation is often more comfortable for those with shoulder issues.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_33",
    "name": "Plate Front Raise",
    "description": "Hold a weight plate with both hands at arm's length. Raise it straight in front of you to shoulder height. Lower with control. This variation provides a different grip and challenges the front delts uniquely.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_34",
    "name": "Cuban Press",
    "description": "Hold dumbbells at shoulder width. Perform an upright row, then externally rotate your shoulders to bring dumbbells overhead, then press up. This complex movement works shoulders and rotator cuffs through multiple planes of motion.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_35",
    "name": "Dumbbell Y-Raise",
    "description": "Bend forward at the hips holding light dumbbells. Raise both arms up and out at 45-degree angles, forming a Y-shape. This targets the lower traps and rear delts, important for shoulder health.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_36",
    "name": "Dumbbell T-Raise",
    "description": "Bend forward at the hips holding dumbbells. Raise both arms straight out to the sides to form a T-shape. This emphasizes the posterior delts and mid-back.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_37",
    "name": "Dumbbell I-Raise",
    "description": "Bend forward at the hips holding dumbbells. Raise both arms straight overhead forming an I-shape. This variation targets the lower traps and helps with shoulder mobility.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_38",
    "name": "Prone Dumbbell Y-Raise",
    "description": "Lie face down on an incline bench holding light dumbbells. Raise both arms up and out at 45 degrees forming a Y. The chest support removes momentum and isolates the targeted muscles.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_39",
    "name": "Lu Raise",
    "description": "Hold a barbell with a wide grip. Raise it up and over your head in an arc motion from front to back, keeping arms relatively straight. This mobility and strength exercise works the shoulders through an extreme range of motion.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_40",
    "name": "Cable Single-Arm Lateral Raise",
    "description": "Stand beside a cable with the handle set at the lowest position. Grab with your near hand and raise it out to the side. The cable provides constant tension and allows for unilateral work.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_41",
    "name": "Cable Single-Arm Front Raise",
    "description": "Stand facing away from a cable machine. Hold the handle and raise your arm forward to shoulder height. Unilateral cable work helps address imbalances.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_42",
    "name": "Alternating Dumbbell Front Raise",
    "description": "Stand holding dumbbells in front of your thighs. Alternately raise one dumbbell at a time to shoulder height. This allows you to focus on each side while maintaining constant tension.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_43",
    "name": "Leaning Lateral Raise",
    "description": "Hold onto a support with one hand and lean away. Perform lateral raises with the free hand. The lean increases the range of motion and changes the resistance curve.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "free_weight",
    "id": "shoulders_44",
    "name": "Six-Way Shoulder Raise",
    "description": "Perform front raises, lateral raises, and bent-over rear raises back-to-back without rest, targeting all three deltoid heads in sequence. This brutal combo exercise provides comprehensive shoulder work.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "bodyweight",
    "id": "shoulders_45",
    "name": "Handstand Push-Up",
    "description": "Kick up into a handstand against a wall. Lower yourself by bending your elbows until your head nearly touches the ground, then press back up. This advanced bodyweight exercise builds tremendous shoulder strength and stability.",
    "isCustom": false,
    "targetMuscles": ["shoulders"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "shoulders_46",
    "name": "Pike Push-Up",
    "description": "Start in a downward dog position with hips high. Lower your head toward the ground by bending your elbows. This bodyweight exercise emphasizes the shoulders more than standard push-ups and serves as a progression toward handstand push-ups.",
    "isCustom": false,
    "targetMuscles": ["shoulders"],
    "canAddWeight": false
  },
  {
    "type": "bodyweight",
    "id": "shoulders_47",
    "name": "Wall Walk",
    "description": "Start in a push-up position with feet against a wall. Walk your hands backward while walking your feet up the wall until you're in a handstand. Reverse to return. This builds shoulder strength and control.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "core"],
    "canAddWeight": false
  },
  {
    "type": "free_weight",
    "id": "shoulders_48",
    "name": "Bus Driver",
    "description": "Hold a weight plate straight out in front of you at shoulder height with arms extended. Rotate the plate back and forth as if steering a bus. This isometric hold with rotation intensely burns the front and medial delts.",
    "isCustom": false,
    "targetMuscles": ["shoulders"]
  },
  {
    "type": "machine",
    "id": "shoulders_49",
    "name": "High Cable Rear Delt Fly",
    "description": "Set cables high and cross your arms to grab opposite handles. Pull back and down in a reverse fly motion emphasizing the rear delts. The high angle provides a unique stimulus.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  },
  {
    "type": "machine",
    "id": "shoulders_50",
    "name": "Low Cable Rear Delt Fly",
    "description": "Set cables low and cross your arms to grab opposite handles. Pull back and up in a reverse fly motion. The low angle targets the rear delts from a different direction than standard variations.",
    "isCustom": false,
    "targetMuscles": ["shoulders", "back"]
  }
]
